Output from Terraform plan
```[command]/home/runner/work/_temp/ccce6bf0-7ee6-43c8-a161-808e3a9579cb/terraform-bin plan -refresh=false -no-color -out=plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.automation_account["nomis-bip-lsast"].azurerm_automation_job_schedule.job_schedules["1"] will be created
  + resource "azurerm_automation_job_schedule" "job_schedules" {
      + automation_account_name = "nomis-bip-lsast-automation-account"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + resource_group_name     = "nomis-bip-lsast"
      + runbook_name            = "stop-vms"
      + schedule_name           = "weekdays 7pm"
    }

  # module.automation_account["nomis-bip-lsast"].azurerm_log_analytics_linked_service.link_log_workspace must be replaced
-/+ resource "azurerm_log_analytics_linked_service" "link_log_workspace" {
      ~ id                  = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-lsast-automation-account/linkedServices/Automation" -> (known after apply)
      ~ linked_service_name = "Automation" -> (known after apply)
      ~ name                = "Automation" -> (known after apply)
      ~ resource_id         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.Automation/automationAccounts/nomis-bip-lsast-automation-account" -> (known after apply)
      - tags                = {} -> null
      ~ workspace_id        = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-lsast-automation-account" -> "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/noms-prod-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-prod1" # forces replacement
      ~ workspace_name      = "nomis-bip-lsast-automation-account" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.automation_account["nomis-bip-lsast"].azurerm_log_analytics_workspace.analytics_workspace will be destroyed
  - resource "azurerm_log_analytics_workspace" "analytics_workspace" {
      - daily_quota_gb             = -1 -> null
      - id                         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-lsast-automation-account" -> null
      - internet_ingestion_enabled = true -> null
      - internet_query_enabled     = true -> null
      - location                   = "ukwest" -> null
      - name                       = "nomis-bip-lsast-automation-account" -> null
      - primary_shared_key         = (sensitive value)
      - resource_group_name        = "nomis-bip-lsast" -> null
      - retention_in_days          = 30 -> null
      - secondary_shared_key       = (sensitive value)
      - sku                        = "PerGB2018" -> null
      - tags                       = {
          - "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          - "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
        } -> null
      - workspace_id               = "bc677b39-7907-4647-b22f-eac1bfa2bfaa" -> null
    }

  # module.automation_account["nomis-bip-lsast"].azurerm_monitor_action_group.email_dso will be updated in-place
  ~ resource "azurerm_monitor_action_group" "email_dso" {
        id                  = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/microsoft.insights/actionGroups/email_dso"
        name                = "email_dso"
      ~ tags                = {
          - "application"      = "BI" -> null
          - "environment_name" = "lsast" -> null
          - "service"          = "NOMIS" -> null
        }
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.automation_account["nomis-bip-lsast"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.Automation/automationAccounts/nomis-bip-lsast-automation-account|nomis-bip-lsast-automation-account"
      ~ log_analytics_workspace_id = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-lsast-automation-account" -> "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/noms-prod-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-prod1"
        name                       = "nomis-bip-lsast-automation-account"
        # (1 unchanged attribute hidden)


        # (5 unchanged blocks hidden)
    }

  # module.automation_account["nomis-bip-lsast"].azurerm_monitor_scheduled_query_rules_alert.alert will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {
      ~ data_source_id          = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-lsast-automation-account" -> "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/noms-prod-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-prod1"
        id                      = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/microsoft.insights/scheduledqueryrules/runbook_error"
        name                    = "runbook_error"
      ~ tags                    = {
          - "application"      = "BI" -> null
          - "environment_name" = "lsast" -> null
          - "service"          = "NOMIS" -> null
        }
        # (11 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.automation_account["nomis-bip-preprod"].azurerm_automation_job_schedule.job_schedules["0"] will be created
  + resource "azurerm_automation_job_schedule" "job_schedules" {
      + automation_account_name = "nomis-bip-preprod-automation-account"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + resource_group_name     = "nomis-bip-preprod"
      + runbook_name            = "start-vms"
      + schedule_name           = "weekdays 6am"
    }

  # module.automation_account["nomis-bip-preprod"].azurerm_automation_job_schedule.job_schedules["1"] will be created
  + resource "azurerm_automation_job_schedule" "job_schedules" {
      + automation_account_name = "nomis-bip-preprod-automation-account"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + resource_group_name     = "nomis-bip-preprod"
      + runbook_name            = "stop-vms"
      + schedule_name           = "weekdays 7pm"
    }

  # module.automation_account["nomis-bip-preprod"].azurerm_log_analytics_linked_service.link_log_workspace must be replaced
-/+ resource "azurerm_log_analytics_linked_service" "link_log_workspace" {
      ~ id                  = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-preprod-automation-account/linkedServices/Automation" -> (known after apply)
      ~ linked_service_name = "Automation" -> (known after apply)
      ~ name                = "Automation" -> (known after apply)
      ~ resource_id         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.Automation/automationAccounts/nomis-bip-preprod-automation-account" -> (known after apply)
      - tags                = {} -> null
      ~ workspace_id        = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-preprod-automation-account" -> "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/noms-prod-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-prod1" # forces replacement
      ~ workspace_name      = "nomis-bip-preprod-automation-account" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.automation_account["nomis-bip-preprod"].azurerm_log_analytics_workspace.analytics_workspace will be destroyed
  - resource "azurerm_log_analytics_workspace" "analytics_workspace" {
      - daily_quota_gb             = -1 -> null
      - id                         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-preprod-automation-account" -> null
      - internet_ingestion_enabled = true -> null
      - internet_query_enabled     = true -> null
      - location                   = "ukwest" -> null
      - name                       = "nomis-bip-preprod-automation-account" -> null
      - primary_shared_key         = (sensitive value)
      - resource_group_name        = "nomis-bip-preprod" -> null
      - retention_in_days          = 30 -> null
      - secondary_shared_key       = (sensitive value)
      - sku                        = "PerGB2018" -> null
      - tags                       = {
          - "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          - "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
        } -> null
      - workspace_id               = "46067dbf-d37c-4b74-8fee-441de8cc2526" -> null
    }

  # module.automation_account["nomis-bip-preprod"].azurerm_monitor_action_group.email_dso will be updated in-place
  ~ resource "azurerm_monitor_action_group" "email_dso" {
        id                  = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/microsoft.insights/actionGroups/email_dso"
        name                = "email_dso"
      ~ tags                = {
          - "application"      = "BI" -> null
          - "environment_name" = "preprod" -> null
          - "service"          = "NOMIS" -> null
        }
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.automation_account["nomis-bip-preprod"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.Automation/automationAccounts/nomis-bip-preprod-automation-account|nomis-bip-preprod-automation-account"
      ~ log_analytics_workspace_id = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-preprod-automation-account" -> "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/noms-prod-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-prod1"
        name                       = "nomis-bip-preprod-automation-account"
        # (1 unchanged attribute hidden)


        # (5 unchanged blocks hidden)
    }

  # module.automation_account["nomis-bip-preprod"].azurerm_monitor_scheduled_query_rules_alert.alert will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {
      ~ data_source_id          = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-preprod-automation-account" -> "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/noms-prod-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-prod1"
        id                      = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/microsoft.insights/scheduledqueryrules/runbook_error"
        name                    = "runbook_error"
      ~ tags                    = {
          - "application"      = "BI" -> null
          - "environment_name" = "preprod" -> null
          - "service"          = "NOMIS" -> null
        }
        # (11 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 5 to add, 6 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_automation_job_schedule.job_schedules["1"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "nomis-bip-lsast-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "nomis-bip-lsast"%0A      + runbook_name            = "stop-vms"%0A      + schedule_name           = "weekdays 7pm"%0A    }%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_log_analytics_linked_service.link_log_workspace must be replaced%0A-/+ resource "azurerm_log_analytics_linked_service" "link_log_workspace" {%0A      ~ id                  = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-lsast-automation-account/linkedServices/Automation" -> (known after apply)%0A      ~ linked_service_name = "Automation" -> (known after apply)%0A      ~ name                = "Automation" -> (known after apply)%0A      ~ resource_id         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.Automation/automationAccounts/nomis-bip-lsast-automation-account" -> (known after apply)%0A      - tags                = {} -> null%0A      ~ workspace_id        = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-lsast-automation-account" -> "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/noms-prod-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-prod1" # forces replacement%0A      ~ workspace_name      = "nomis-bip-lsast-automation-account" -> (known after apply)%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_log_analytics_workspace.analytics_workspace will be destroyed%0A  - resource "azurerm_log_analytics_workspace" "analytics_workspace" {%0A      - daily_quota_gb             = -1 -> null%0A      - id                         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-lsast-automation-account" -> null%0A      - internet_ingestion_enabled = true -> null%0A      - internet_query_enabled     = true -> null%0A      - location                   = "ukwest" -> null%0A      - name                       = "nomis-bip-lsast-automation-account" -> null%0A      - primary_shared_key         = (sensitive value)%0A      - resource_group_name        = "nomis-bip-lsast" -> null%0A      - retention_in_days          = 30 -> null%0A      - secondary_shared_key       = (sensitive value)%0A      - sku                        = "PerGB2018" -> null%0A      - tags                       = {%0A          - "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          - "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        } -> null%0A      - workspace_id               = "bc677b39-7907-4647-b22f-eac1bfa2bfaa" -> null%0A    }%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_monitor_action_group.email_dso will be updated in-place%0A  ~ resource "azurerm_monitor_action_group" "email_dso" {%0A        id                  = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/microsoft.insights/actionGroups/email_dso"%0A        name                = "email_dso"%0A      ~ tags                = {%0A          - "application"      = "BI" -> null%0A          - "environment_name" = "lsast" -> null%0A          - "service"          = "NOMIS" -> null%0A        }%0A        # (3 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be updated in-place%0A  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {%0A        id                         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.Automation/automationAccounts/nomis-bip-lsast-automation-account|nomis-bip-lsast-automation-account"%0A      ~ log_analytics_workspace_id = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-lsast-automation-account" -> "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/noms-prod-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-prod1"%0A        name                       = "nomis-bip-lsast-automation-account"%0A        # (1 unchanged attribute hidden)%0A%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_monitor_scheduled_query_rules_alert.alert will be updated in-place%0A  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {%0A      ~ data_source_id          = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-lsast-automation-account" -> "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/noms-prod-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-prod1"%0A        id                      = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/microsoft.insights/scheduledqueryrules/runbook_error"%0A        name                    = "runbook_error"%0A      ~ tags                    = {%0A          - "application"      = "BI" -> null%0A          - "environment_name" = "lsast" -> null%0A          - "service"          = "NOMIS" -> null%0A        }%0A        # (11 unchanged attributes hidden)%0A%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_automation_job_schedule.job_schedules["0"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "nomis-bip-preprod-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "nomis-bip-preprod"%0A      + runbook_name            = "start-vms"%0A      + schedule_name           = "weekdays 6am"%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_automation_job_schedule.job_schedules["1"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "nomis-bip-preprod-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "nomis-bip-preprod"%0A      + runbook_name            = "stop-vms"%0A      + schedule_name           = "weekdays 7pm"%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_log_analytics_linked_service.link_log_workspace must be replaced%0A-/+ resource "azurerm_log_analytics_linked_service" "link_log_workspace" {%0A      ~ id                  = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-preprod-automation-account/linkedServices/Automation" -> (known after apply)%0A      ~ linked_service_name = "Automation" -> (known after apply)%0A      ~ name                = "Automation" -> (known after apply)%0A      ~ resource_id         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.Automation/automationAccounts/nomis-bip-preprod-automation-account" -> (known after apply)%0A      - tags                = {} -> null%0A      ~ workspace_id        = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-preprod-automation-account" -> "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/noms-prod-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-prod1" # forces replacement%0A      ~ workspace_name      = "nomis-bip-preprod-automation-account" -> (known after apply)%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_log_analytics_workspace.analytics_workspace will be destroyed%0A  - resource "azurerm_log_analytics_workspace" "analytics_workspace" {%0A      - daily_quota_gb             = -1 -> null%0A      - id                         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-preprod-automation-account" -> null%0A      - internet_ingestion_enabled = true -> null%0A      - internet_query_enabled     = true -> null%0A      - location                   = "ukwest" -> null%0A      - name                       = "nomis-bip-preprod-automation-account" -> null%0A      - primary_shared_key         = (sensitive value)%0A      - resource_group_name        = "nomis-bip-preprod" -> null%0A      - retention_in_days          = 30 -> null%0A      - secondary_shared_key       = (sensitive value)%0A      - sku                        = "PerGB2018" -> null%0A      - tags                       = {%0A          - "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          - "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        } -> null%0A      - workspace_id               = "46067dbf-d37c-4b74-8fee-441de8cc2526" -> null%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_monitor_action_group.email_dso will be updated in-place%0A  ~ resource "azurerm_monitor_action_group" "email_dso" {%0A        id                  = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/microsoft.insights/actionGroups/email_dso"%0A        name                = "email_dso"%0A      ~ tags                = {%0A          - "application"      = "BI" -> null%0A          - "environment_name" = "preprod" -> null%0A          - "service"          = "NOMIS" -> null%0A        }%0A        # (3 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be updated in-place%0A  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {%0A        id                         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.Automation/automationAccounts/nomis-bip-preprod-automation-account|nomis-bip-preprod-automation-account"%0A      ~ log_analytics_workspace_id = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-preprod-automation-account" -> "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/noms-prod-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-prod1"%0A        name                       = "nomis-bip-preprod-automation-account"%0A        # (1 unchanged attribute hidden)%0A%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_monitor_scheduled_query_rules_alert.alert will be updated in-place%0A  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {%0A      ~ data_source_id          = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-preprod-automation-account" -> "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/noms-prod-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-prod1"%0A        id                      = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/microsoft.insights/scheduledqueryrules/runbook_error"%0A        name                    = "runbook_error"%0A      ~ tags                    = {%0A          - "application"      = "BI" -> null%0A          - "environment_name" = "preprod" -> null%0A          - "service"          = "NOMIS" -> null%0A        }%0A        # (11 unchanged attributes hidden)%0A%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0APlan: 5 to add, 6 to change, 4 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "plan"%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_automation_job_schedule.job_schedules["1"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "nomis-bip-lsast-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "nomis-bip-lsast"%0A      + runbook_name            = "stop-vms"%0A      + schedule_name           = "weekdays 7pm"%0A    }%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_log_analytics_linked_service.link_log_workspace must be replaced%0A-/+ resource "azurerm_log_analytics_linked_service" "link_log_workspace" {%0A      ~ id                  = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-lsast-automation-account/linkedServices/Automation" -> (known after apply)%0A      ~ linked_service_name = "Automation" -> (known after apply)%0A      ~ name                = "Automation" -> (known after apply)%0A      ~ resource_id         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.Automation/automationAccounts/nomis-bip-lsast-automation-account" -> (known after apply)%0A      - tags                = {} -> null%0A      ~ workspace_id        = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-lsast-automation-account" -> "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/noms-prod-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-prod1" # forces replacement%0A      ~ workspace_name      = "nomis-bip-lsast-automation-account" -> (known after apply)%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_log_analytics_workspace.analytics_workspace will be destroyed%0A  - resource "azurerm_log_analytics_workspace" "analytics_workspace" {%0A      - daily_quota_gb             = -1 -> null%0A      - id                         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-lsast-automation-account" -> null%0A      - internet_ingestion_enabled = true -> null%0A      - internet_query_enabled     = true -> null%0A      - location                   = "ukwest" -> null%0A      - name                       = "nomis-bip-lsast-automation-account" -> null%0A      - primary_shared_key         = (sensitive value)%0A      - resource_group_name        = "nomis-bip-lsast" -> null%0A      - retention_in_days          = 30 -> null%0A      - secondary_shared_key       = (sensitive value)%0A      - sku                        = "PerGB2018" -> null%0A      - tags                       = {%0A          - "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          - "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        } -> null%0A      - workspace_id               = "bc677b39-7907-4647-b22f-eac1bfa2bfaa" -> null%0A    }%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_monitor_action_group.email_dso will be updated in-place%0A  ~ resource "azurerm_monitor_action_group" "email_dso" {%0A        id                  = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/microsoft.insights/actionGroups/email_dso"%0A        name                = "email_dso"%0A      ~ tags                = {%0A          - "application"      = "BI" -> null%0A          - "environment_name" = "lsast" -> null%0A          - "service"          = "NOMIS" -> null%0A        }%0A        # (3 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be updated in-place%0A  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {%0A        id                         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.Automation/automationAccounts/nomis-bip-lsast-automation-account|nomis-bip-lsast-automation-account"%0A      ~ log_analytics_workspace_id = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-lsast-automation-account" -> "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/noms-prod-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-prod1"%0A        name                       = "nomis-bip-lsast-automation-account"%0A        # (1 unchanged attribute hidden)%0A%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-lsast"].azurerm_monitor_scheduled_query_rules_alert.alert will be updated in-place%0A  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {%0A      ~ data_source_id          = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-lsast-automation-account" -> "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/noms-prod-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-prod1"%0A        id                      = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-lsast/providers/microsoft.insights/scheduledqueryrules/runbook_error"%0A        name                    = "runbook_error"%0A      ~ tags                    = {%0A          - "application"      = "BI" -> null%0A          - "environment_name" = "lsast" -> null%0A          - "service"          = "NOMIS" -> null%0A        }%0A        # (11 unchanged attributes hidden)%0A%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_automation_job_schedule.job_schedules["0"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "nomis-bip-preprod-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "nomis-bip-preprod"%0A      + runbook_name            = "start-vms"%0A      + schedule_name           = "weekdays 6am"%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_automation_job_schedule.job_schedules["1"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "nomis-bip-preprod-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "nomis-bip-preprod"%0A      + runbook_name            = "stop-vms"%0A      + schedule_name           = "weekdays 7pm"%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_log_analytics_linked_service.link_log_workspace must be replaced%0A-/+ resource "azurerm_log_analytics_linked_service" "link_log_workspace" {%0A      ~ id                  = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-preprod-automation-account/linkedServices/Automation" -> (known after apply)%0A      ~ linked_service_name = "Automation" -> (known after apply)%0A      ~ name                = "Automation" -> (known after apply)%0A      ~ resource_id         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.Automation/automationAccounts/nomis-bip-preprod-automation-account" -> (known after apply)%0A      - tags                = {} -> null%0A      ~ workspace_id        = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-preprod-automation-account" -> "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/noms-prod-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-prod1" # forces replacement%0A      ~ workspace_name      = "nomis-bip-preprod-automation-account" -> (known after apply)%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_log_analytics_workspace.analytics_workspace will be destroyed%0A  - resource "azurerm_log_analytics_workspace" "analytics_workspace" {%0A      - daily_quota_gb             = -1 -> null%0A      - id                         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-preprod-automation-account" -> null%0A      - internet_ingestion_enabled = true -> null%0A      - internet_query_enabled     = true -> null%0A      - location                   = "ukwest" -> null%0A      - name                       = "nomis-bip-preprod-automation-account" -> null%0A      - primary_shared_key         = (sensitive value)%0A      - resource_group_name        = "nomis-bip-preprod" -> null%0A      - retention_in_days          = 30 -> null%0A      - secondary_shared_key       = (sensitive value)%0A      - sku                        = "PerGB2018" -> null%0A      - tags                       = {%0A          - "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          - "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        } -> null%0A      - workspace_id               = "46067dbf-d37c-4b74-8fee-441de8cc2526" -> null%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_monitor_action_group.email_dso will be updated in-place%0A  ~ resource "azurerm_monitor_action_group" "email_dso" {%0A        id                  = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/microsoft.insights/actionGroups/email_dso"%0A        name                = "email_dso"%0A      ~ tags                = {%0A          - "application"      = "BI" -> null%0A          - "environment_name" = "preprod" -> null%0A          - "service"          = "NOMIS" -> null%0A        }%0A        # (3 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be updated in-place%0A  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {%0A        id                         = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.Automation/automationAccounts/nomis-bip-preprod-automation-account|nomis-bip-preprod-automation-account"%0A      ~ log_analytics_workspace_id = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-preprod-automation-account" -> "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/noms-prod-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-prod1"%0A        name                       = "nomis-bip-preprod-automation-account"%0A        # (1 unchanged attribute hidden)%0A%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-preprod"].azurerm_monitor_scheduled_query_rules_alert.alert will be updated in-place%0A  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {%0A      ~ data_source_id          = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/Microsoft.OperationalInsights/workspaces/nomis-bip-preprod-automation-account" -> "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/noms-prod-loganalytics/providers/Microsoft.OperationalInsights/workspaces/noms-prod1"%0A        id                      = "/subscriptions/1d95dcda-65b2-4273-81df-eb979c6b547b/resourceGroups/nomis-bip-preprod/providers/microsoft.insights/scheduledqueryrules/runbook_error"%0A        name                    = "runbook_error"%0A      ~ tags                    = {%0A          - "application"      = "BI" -> null%0A          - "environment_name" = "preprod" -> null%0A          - "service"          = "NOMIS" -> null%0A        }%0A        # (11 unchanged attributes hidden)%0A%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0APlan: 5 to add, 6 to change, 4 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "plan"%0A

::set-output name=stderr::

::set-output name=exitcode::0
```